Documents/InvoiceForPayment.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>InvoiceForPayment</Name>
			<BasedOn>
				<xr:Item>Document.CustomerOrder</xr:Item>
				<xr:Item>Document.CustomerInvoice</xr:Item>
				<xr:Item>Document.ProcessingReport</xr:Item>
				<xr:Item>Document.AcceptanceCertificate</xr:Item>
				<xr:Item>Document.Event</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.InvoicesAndOrdersPayment</xr:Item>
				<xr:Item>AccumulationRegister.PaymentCalendar</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BasisDocument</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CustomerInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.AcceptanceCertificate</v8:Type>
						<v8:Type>cfg:DocumentRef.ProcessingReport</v8:Type>
						<v8:Type>cfg:DocumentRef.CustomerOrder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Counterparty</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Contract</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CounterpartyContracts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CashAssetsType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CashAssetTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BankAccount</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BankAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Multiplicity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExchangeRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VATTaxation</Name>
					<Type>
						<v8:Type>cfg:EnumRef.VATTaxationTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AmountIncludesVAT</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PriceKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PriceKinds</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DiscountMarkupKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.MarkupAndDiscountKinds</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Division</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.StructuralUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PettyCash</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PettyCashes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Event</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Event</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SchedulePayment</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DiscountPercentByDiscountCard</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DiscountCard</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DiscountCards</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DiscountsAreCalculated</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Inventory</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ProductsAndServices</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsAndServices</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Characteristic</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsAndServicesCharacteristics</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Batch</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsAndServicesBatches</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>MeasurementUnit</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.UOMClassifier</v8:Type>
								<v8:Type>cfg:CatalogRef.UOM</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DiscountMarkupPercent</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VATRate</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VATAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Total</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Content</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ConnectionKey</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AutomaticDiscountAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AutomaticDiscountsPercent</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>PaymentCalendar</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>PayDate</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PaymentPercentage</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PaymentAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PayVATAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInformation</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>DiscountsMarkups</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ConnectionKey</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DiscountMarkup</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.AutomaticDiscounts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/CurrencyRates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>CurrencyRates</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ExchangeRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Multiplicity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/CashAssetTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>CashAssetTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Cash</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Noncash</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/InvoiceForPayment/Ext/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region ServiceProceduresAndFunctions

// Posting cancellation procedure of the subordinate customer invoice note
//
Procedure SubordinatedInvoiceControl()
	
	InvoiceStructure = SmallBusinessServer.GetSubordinateInvoice(Ref);
	If Not InvoiceStructure = Undefined Then
		
		CustomerInvoiceNote	 = InvoiceStructure.Ref;
		If CustomerInvoiceNote.Posted Then
			
			MessageText = NStr("en = 'As there are no register records of the %CurrentDocumentPresentation% document, undo the posting of %InvoicePresentation%.'");
			MessageText = StrReplace(MessageText, "%CurrentDocumentPresentation%", """Account on payment No. " + Number + " from " + Format(Date, "DF=dd.MM.yyyy") + """");
			MessageText = StrReplace(MessageText, "%InvoicePresentation%", """Customer invoice note (issued) No " + InvoiceStructure.Number + " from " + InvoiceStructure.Date + """");
			
			CommonUseClientServer.MessageToUser(MessageText);
			
			InvoiceObject = CustomerInvoiceNote.GetObject();
			InvoiceObject.Write(DocumentWriteMode.UndoPosting);
			
		EndIf;
		
	EndIf;
	
EndProcedure //SubordinateInvoiceControl()

#EndRegion

#Region EventsHandlers

// Procedure - event handler "Posting".
//
Procedure Posting(Cancel, PostingMode)
	
	// Initialization of additional properties for document posting
	SmallBusinessServer.InitializeAdditionalPropertiesForPosting(Ref, AdditionalProperties);
	
	// Initialization of document data
	Documents.InvoiceForPayment.InitializeDocumentData(Ref, AdditionalProperties);
	
	// Preparation of record sets
	SmallBusinessServer.PrepareRecordSetsForRecording(ThisObject);
	
	// Registering in accounting sections
	SmallBusinessServer.ReflectPaymentCalendar(AdditionalProperties, RegisterRecords, Cancel);
	SmallBusinessServer.ReflectInvoicesAndOrdersPayment(AdditionalProperties, RegisterRecords, Cancel);
	
	AdditionalProperties.ForPosting.StructureTemporaryTables.TempTablesManager.Close();
	
EndProcedure // Posting()

// Procedure - event handler BeforeWrite object.
//
Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	DocumentAmount = Inventory.Total("Total");
	
	If ValueIsFilled(Counterparty)
	AND Not Counterparty.DoOperationsByContracts
	AND Not ValueIsFilled(Contract) Then
		Contract = Counterparty.ContractByDefault;
	EndIf;
	
EndProcedure // BeforeWrite()

// Procedure - event handler FillingProcessor object.
//
Procedure Filling(FillingData, StandardProcessing) Export
	
	UseAutomaticDiscounts = GetFunctionalOption("UseAutomaticDiscountsMarkups");
	
	If TypeOf(FillingData) = Type("DocumentRef.CustomerOrder") Then
		
		Company		= FillingData.Company;
		DocumentCurrency = FillingData.DocumentCurrency;
		Contract			= FillingData.Contract;
		Counterparty		= FillingData.Counterparty;
		BankAccount	= FillingData.Company.BankAccountByDefault;
		VATTaxation = FillingData.VATTaxation;
		// DiscountCards
		DiscountCard = FillingData.DiscountCard;
		DiscountPercentByDiscountCard = FillingData.DiscountPercentByDiscountCard;
		// End DiscountCards
		
		If DocumentCurrency = Constants.NationalCurrency.Get() Then
			ExchangeRate = FillingData.ExchangeRate;
			Multiplicity = FillingData.Multiplicity;
		Else
			StructureByCurrency = InformationRegisters.CurrencyRates.GetLast(Date, New Structure("Currency", Contract.SettlementsCurrency));
			ExchangeRate = StructureByCurrency.ExchangeRate;
			Multiplicity = StructureByCurrency.Multiplicity;
		EndIf;
		
		Company		  = FillingData.Company;
		AmountIncludesVAT  = FillingData.AmountIncludesVAT;
		BasisDocument = FillingData;
		
		Inventory.Clear();
		
		For Each CurStringInventory IN FillingData.Inventory Do
			NewRow = Inventory.Add();
			NewRow.ProductsAndServices		 = CurStringInventory.ProductsAndServices;
			NewRow.Characteristic		 = CurStringInventory.Characteristic;
			NewRow.Batch				 = CurStringInventory.Batch;
			NewRow.Content			 = CurStringInventory.Content;
			NewRow.MeasurementUnit	 = CurStringInventory.MeasurementUnit;
			NewRow.Quantity			 = CurStringInventory.Quantity;
			NewRow.Price				 = CurStringInventory.Price;	
			NewRow.DiscountMarkupPercent = CurStringInventory.DiscountMarkupPercent;	
			NewRow.Amount				 = CurStringInventory.Amount;
			NewRow.VATRate			 = CurStringInventory.VATRate;
			NewRow.VATAmount			 = CurStringInventory.VATAmount;
			NewRow.Total				 = CurStringInventory.Total;
			// AutomaticDiscounts
			If UseAutomaticDiscounts Then
				NewRow.ConnectionKey			 = CurStringInventory.ConnectionKey;
				NewRow.AutomaticDiscountAmount	= CurStringInventory.AutomaticDiscountAmount;
				NewRow.AutomaticDiscountsPercent	= CurStringInventory.AutomaticDiscountsPercent;
			EndIf;
			// End AutomaticDiscounts
		EndDo;
		
		For Each CurRowWork IN FillingData.Works Do
			NewRow = Inventory.Add();
			NewRow.ProductsAndServices		 = CurRowWork.ProductsAndServices;
			NewRow.Characteristic		 = CurRowWork.Characteristic;
			NewRow.Content			 = CurRowWork.Content;
			NewRow.MeasurementUnit	 = CurRowWork.ProductsAndServices.MeasurementUnit;
			NewRow.Quantity			 = CurRowWork.Quantity * CurRowWork.Factor * CurRowWork.Multiplicity;
			NewRow.Price				 = CurRowWork.Price;	
			NewRow.DiscountMarkupPercent = CurRowWork.DiscountMarkupPercent;	
			NewRow.Amount				 = CurRowWork.Amount;
			NewRow.VATRate			 = CurRowWork.VATRate;
			NewRow.VATAmount			 = CurRowWork.VATAmount;
			NewRow.Total				 = CurRowWork.Total;
		EndDo;
		
		PaymentAmount = Inventory.Total("Total");
		
		// AutomaticDiscounts
		If UseAutomaticDiscounts Then
			DiscountsMarkups.Load(FillingData.DiscountsMarkups.Unload());
			DiscountsAreCalculated = FillingData.DiscountsAreCalculated;
		EndIf;
		// End AutomaticDiscounts
		
	ElsIf TypeOf(FillingData) = Type("DocumentRef.CustomerInvoice") Then
		
		Company		= FillingData.Company;
		DocumentCurrency = FillingData.DocumentCurrency;
		Contract			= FillingData.Contract;
		Counterparty		= FillingData.Counterparty;
		BankAccount	= FillingData.Company.BankAccountByDefault;
		VATTaxation = FillingData.VATTaxation;
		// DiscountCards
		DiscountCard = FillingData.DiscountCard;
		DiscountPercentByDiscountCard = FillingData.DiscountPercentByDiscountCard;
		// End DiscountCards
		
		If DocumentCurrency = Constants.NationalCurrency.Get() Then
			ExchangeRate = FillingData.ExchangeRate;
			Multiplicity = FillingData.Multiplicity;
		Else
			StructureByCurrency = InformationRegisters.CurrencyRates.GetLast(Date, New Structure("Currency", Contract.SettlementsCurrency));
			ExchangeRate = StructureByCurrency.ExchangeRate;
			Multiplicity = StructureByCurrency.Multiplicity;
		EndIf;

		Company		  = FillingData.Company;
		AmountIncludesVAT  = FillingData.AmountIncludesVAT;
		BasisDocument = FillingData;
		
		Inventory.Clear();
		
		For Each CurStringInventory IN FillingData.Inventory Do
			
			NewRow = Inventory.Add();
			NewRow.ProductsAndServices		 = CurStringInventory.ProductsAndServices;
			NewRow.Characteristic		 = CurStringInventory.Characteristic;
			NewRow.Batch				 = CurStringInventory.Batch;
			NewRow.MeasurementUnit	 = CurStringInventory.MeasurementUnit;
			NewRow.Quantity			 = CurStringInventory.Quantity;
			NewRow.Price				 = CurStringInventory.Price;	
			NewRow.DiscountMarkupPercent = CurStringInventory.DiscountMarkupPercent;	
			NewRow.Amount				 = CurStringInventory.Amount;
			NewRow.VATRate			 = CurStringInventory.VATRate;
			NewRow.VATAmount			 = CurStringInventory.VATAmount;
			NewRow.Total				 = CurStringInventory.Total;
			NewRow.Content 			 = CurStringInventory.Content;
			// AutomaticDiscounts
			If UseAutomaticDiscounts Then
				NewRow.ConnectionKey			 = CurStringInventory.ConnectionKey;
				NewRow.AutomaticDiscountAmount	= CurStringInventory.AutomaticDiscountAmount;
				NewRow.AutomaticDiscountsPercent	= CurStringInventory.AutomaticDiscountsPercent;
			EndIf;
			// End AutomaticDiscounts
			
		EndDo;
		
		PaymentAmount = Inventory.Total("Total");
		
		// AutomaticDiscounts
		If UseAutomaticDiscounts Then
			DiscountsMarkups.Load(FillingData.DiscountsMarkups.Unload());
			DiscountsAreCalculated = FillingData.DiscountsAreCalculated;
		EndIf;
		// End AutomaticDiscounts
		
	ElsIf TypeOf(FillingData) = Type("DocumentRef.AcceptanceCertificate") Then
		
		Company		= FillingData.Company;
		DocumentCurrency = FillingData.DocumentCurrency;
		Contract			= FillingData.Contract;
		Counterparty		= FillingData.Counterparty;
		BankAccount	= FillingData.Company.BankAccountByDefault;
		VATTaxation = FillingData.VATTaxation;
		// DiscountCards
		DiscountCard = FillingData.DiscountCard;
		DiscountPercentByDiscountCard = FillingData.DiscountPercentByDiscountCard;
		// End DiscountCards
		
		If DocumentCurrency = Constants.NationalCurrency.Get() Then
			ExchangeRate = FillingData.ExchangeRate;
			Multiplicity = FillingData.Multiplicity;
		Else
			StructureByCurrency = InformationRegisters.CurrencyRates.GetLast(Date, New Structure("Currency", Contract.SettlementsCurrency));
			ExchangeRate = StructureByCurrency.ExchangeRate;
			Multiplicity = StructureByCurrency.Multiplicity;
		EndIf;

		Company		  = FillingData.Company;
		AmountIncludesVAT  = FillingData.AmountIncludesVAT;
		BasisDocument = FillingData;
		
		Inventory.Clear();
		
		For Each CurStringInventory IN FillingData.WorksAndServices Do
			NewRow = Inventory.Add();
			NewRow.ProductsAndServices		 = CurStringInventory.ProductsAndServices;
			NewRow.Characteristic		 = CurStringInventory.Characteristic;
			NewRow.MeasurementUnit	 = CurStringInventory.MeasurementUnit;
			NewRow.Quantity			 = CurStringInventory.Quantity;
			NewRow.Price				 = CurStringInventory.Price;	
			NewRow.DiscountMarkupPercent = CurStringInventory.DiscountMarkupPercent;	
			NewRow.Amount				 = CurStringInventory.Amount;
			NewRow.VATRate			 = CurStringInventory.VATRate;
			NewRow.VATAmount			 = CurStringInventory.VATAmount;
			NewRow.Total				 = CurStringInventory.Total;
			NewRow.Content 			 = CurStringInventory.Content;
			// AutomaticDiscounts
			If UseAutomaticDiscounts Then
				NewRow.ConnectionKey			 = CurStringInventory.ConnectionKey;
				NewRow.AutomaticDiscountAmount	= CurStringInventory.AutomaticDiscountAmount;
				NewRow.AutomaticDiscountsPercent	= CurStringInventory.AutomaticDiscountsPercent;
			EndIf;
			// End AutomaticDiscounts
		EndDo;
		
		PaymentAmount = Inventory.Total("Total");
		
		// AutomaticDiscounts
		If UseAutomaticDiscounts Then
			DiscountsMarkups.Load(FillingData.DiscountsMarkups.Unload());
			DiscountsAreCalculated = FillingData.DiscountsAreCalculated;
		EndIf;
		// End AutomaticDiscounts
		
	ElsIf TypeOf(FillingData) = Type("DocumentRef.ProcessingReport") Then
		
		Company		= FillingData.Company;
		DocumentCurrency = FillingData.DocumentCurrency;
		Contract			= FillingData.Contract;
		Counterparty		= FillingData.Counterparty;
		BankAccount	= FillingData.Company.BankAccountByDefault;
		VATTaxation = FillingData.VATTaxation;
		
		If DocumentCurrency = Constants.NationalCurrency.Get() Then
			ExchangeRate = FillingData.ExchangeRate;
			Multiplicity = FillingData.Multiplicity;
		Else
			StructureByCurrency = InformationRegisters.CurrencyRates.GetLast(Date, New Structure("Currency", Contract.SettlementsCurrency));
			ExchangeRate = StructureByCurrency.ExchangeRate;
			Multiplicity = StructureByCurrency.Multiplicity;
		EndIf;

		Company		  = FillingData.Company;
		AmountIncludesVAT  = FillingData.AmountIncludesVAT;
		BasisDocument = FillingData;
		
		Inventory.Clear();
		
		For Each CurStringInventory IN FillingData.Products Do
			
			NewRow = Inventory.Add();
			NewRow.ProductsAndServices		 = CurStringInventory.ProductsAndServices;
			NewRow.Characteristic		 = CurStringInventory.Characteristic;
			NewRow.Batch				 = CurStringInventory.Batch;
			NewRow.MeasurementUnit	 = CurStringInventory.MeasurementUnit;
			NewRow.Quantity			 = CurStringInventory.Quantity;
			NewRow.Price				 = CurStringInventory.Price;	
			NewRow.DiscountMarkupPercent = CurStringInventory.DiscountMarkupPercent;	
			NewRow.Amount				 = CurStringInventory.Amount;
			NewRow.VATRate			 = CurStringInventory.VATRate;
			NewRow.VATAmount			 = CurStringInventory.VATAmount;
			NewRow.Total				 = CurStringInventory.Total; 
			NewRow.Content 			 = CurStringInventory.Content;
			
		EndDo;
		
		PaymentAmount = Inventory.Total("Total");
		
	ElsIf TypeOf(FillingData) = Type("DocumentRef.Event") Then
	
		Event = FillingData.Ref;
		If FillingData.Parties.Count() > 0 AND TypeOf(FillingData.Parties[0].Contact) = Type("CatalogRef.Counterparties") Then
			Counterparty = FillingData.Parties[0].Contact;
			Contract = Counterparty.ContractByDefault;
		EndIf;
		
		StructureByCurrency = InformationRegisters.CurrencyRates.GetLast(Date, New Structure("Currency", Contract.SettlementsCurrency));
		ExchangeRate = StructureByCurrency.ExchangeRate;
		Multiplicity = StructureByCurrency.Multiplicity;
		
		SettingValue = SmallBusinessReUse.GetValueByDefaultUser(Users.CurrentUser(), "MainCompany");
		If ValueIsFilled(SettingValue) Then
			If Company <> SettingValue Then
				Company = SettingValue;
			EndIf;
		Else
			Company = Catalogs.Companies.MainCompany;	
		EndIf;
		
		VATTaxation = SmallBusinessServer.VATTaxation(Company,, Date);
		
	EndIf;
	
EndProcedure // FillingProcessor()

// Procedure - event handler FillCheckProcessing object.
//
Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	// 100% discount.
	ThereAreManualDiscounts = GetFunctionalOption("UseDiscountsMarkups");
	ThereAreAutomaticDiscounts = GetFunctionalOption("UseAutomaticDiscountsMarkups"); // AutomaticDiscounts
	If ThereAreManualDiscounts OR ThereAreAutomaticDiscounts Then
		For Each StringInventory IN Inventory Do
			// AutomaticDiscounts
			CurAmount = StringInventory.Price * StringInventory.Quantity;
			ManualDiscountCurAmount = ?(ThereAreManualDiscounts, ROUND(CurAmount * StringInventory.DiscountMarkupPercent / 100, 2), 0);
			AutomaticDiscountCurAmount = ?(ThereAreAutomaticDiscounts, StringInventory.AutomaticDiscountAmount, 0);
			CurAmountDiscounts = ManualDiscountCurAmount + AutomaticDiscountCurAmount;
			If StringInventory.DiscountMarkupPercent <> 100 AND CurAmountDiscounts < CurAmount
				AND Not ValueIsFilled(StringInventory.Amount) Then
				MessageText = NStr("en = 'Column ""Amount"" is not populated in string %Number% of list ""Inventory"".'");
				MessageText = StrReplace(MessageText, "%Number%", StringInventory.LineNumber);
				SmallBusinessServer.ShowMessageAboutError(
					ThisObject,
					MessageText,
					"Inventory",
					StringInventory.LineNumber,
					"Amount",
					Cancel
				);
			EndIf;
		EndDo;
	EndIf;
	
	If SchedulePayment
		AND CashAssetsType = Enums.CashAssetTypes.Noncash Then
		
		SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "PettyCash");
		
	ElsIf SchedulePayment
		AND CashAssetsType = Enums.CashAssetTypes.Cash Then
		
		SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "BankAccount");
		
	Else
		
		SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "PettyCash");
		SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "BankAccount");
		
	EndIf;
	
	If SchedulePayment
		AND PaymentCalendar.Count() = 1
		AND Not ValueIsFilled(PaymentCalendar[0].PayDate) Then
		
		MessageText = NStr("en = 'Field ""Payment date"" is required.'");
		SmallBusinessServer.ShowMessageAboutError(ThisObject, MessageText, , , "PayDate", Cancel);
		SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "PaymentCalendar.PaymentDate");
		
	EndIf;
	
	If Not Counterparty.DoOperationsByContracts Then
		SmallBusinessServer.DeleteAttributeBeingChecked(CheckedAttributes, "Contract");
	EndIf;
	
EndProcedure // FillCheckProcessing()

// Procedure - event handler UndoPosting object.
//
Procedure UndoPosting(Cancel)
	
	// Subordinate customer invoice note
	If Not Cancel Then
		
		SubordinatedInvoiceControl();
		
	EndIf;
	
EndProcedure // UndoPosting()

#EndRegion

#EndIf
